In [1]:
import pandas as pd
import seaborn as s

In [2]:
df = s.load_dataset("tips")

In [3]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [4]:
df.time.unique()

['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [5]:
len(df)

244

In [6]:
len(df.time)

244

In [7]:
a = list(df.iloc[:,5])

In [8]:
a

['Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Lunch',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner',
 'Dinner']

## Leetcode problem: 1683. Invalid Tweets

In [9]:
tweets = pd.DataFrame({
    "tweet_id": [1,2],
    "content": ["Let us Code","More than fifteen chars are here!"]
})

In [10]:
tweets

   tweet_id                            content
0         1                        Let us Code
1         2  More than fifteen chars are here!

In [11]:
tweets.content

0                          Let us Code
1    More than fifteen chars are here!
Name: content, dtype: object

In [12]:
tweets.content.str.len()

0    11
1    33
Name: content, dtype: int64

In [13]:
res = tweets[tweets.content.str.len() > 15]

In [14]:
pd.DataFrame(res.tweet_id)

   tweet_id
1         2

## 1873. Calculate Special Bonus Leetcode problem

In [15]:
Employees = pd.DataFrame({
    'employee_id': [2, 3, 7, 8, 9],
    'name': ['Meir', 'Michael', 'Addilyn', 'Juan', 'Kannon'],
    'salary': [3000, 3800, 7400, 6100, 7700]
})

In [16]:
Employees

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [17]:
Employees[Employees.name.str.startswith("M")]

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800

In [18]:
Employees[~Employees.employee_id % 2 == 0]

   employee_id     name  salary
1            3  Michael    3800
2            7  Addilyn    7400
4            9   Kannon    7700

In [19]:
Employees.loc[(~Employees.employee_id%2==0)&(~Employees.name.str.startswith("M"))]

   employee_id     name  salary
2            7  Addilyn    7400
4            9   Kannon    7700

In [20]:
eligible_for_bonus = Employees[(~Employees.employee_id%2==0)&(~Employees.name.str.startswith("M"))]

In [21]:
eligible_for_bonus

   employee_id     name  salary
2            7  Addilyn    7400
4            9   Kannon    7700

In [22]:
import numpy as np

In [23]:
condition = ((~Employees.employee_id%2==0)&(~Employees.name.str.startswith("M")))
Employees["bonus"] = np.where(condition,Employees.salary,0)

In [24]:
Employees

   employee_id     name  salary  bonus
0            2     Meir    3000      0
1            3  Michael    3800      0
2            7  Addilyn    7400   7400
3            8     Juan    6100      0
4            9   Kannon    7700   7700

In [26]:
Employees[["employee_id","bonus"]].sort_values(by="employee_id")

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700